//=========================================
// 
// ゲーム内処理(ヘッダーファイル)
// Author YudaKaito
// 
//=========================================
#ifndef _GAME_H_
#define _GAME_H_

//------------------------------------
// include
//------------------------------------
#include "game.h"

//------------------------------------
// プロトタイプ宣言
//------------------------------------
void InitGame(void);	// 初期化処理
void UnInitGame(void);	// 終了処理
void UpdateGame(void);	// 更新処理
void DrawGame(void);	// 描画処理

#endif // !_COMMON_H_
